# MySQL Constraints

MySQL constraints are rules applied to table columns to ensure **data integrity, consistency, and reliability** across the database.

**Data Integrity**  
Integrity refers to the **accuracy and validity** of data stored in the database.  
It ensures that only correct and meaningful data is allowed, preventing invalid or incorrect entries.
*Example:* A `CHECK (quantity > 0)` rule prevents storing negative order quantities.

**Data Consistency**  
Consistency means the data remains **uniform and logically aligned** across the entire database.  
The same rules apply everywhere, avoiding conflicts or mismatches between related tables.
*Example:* A foreign key ensures every `order.customer_id` exists in the `customers` table.

**Data Reliability**  
Reliability refers to the **trustworthiness of data over time**.  
Applications and users can depend on the data to remain stable, predictable, and compliant with defined rules.
*Example:* With primary keys and constraints enforced, reports always reference valid and unchanged records.


- **NOT NULL** 
Ensures that a column **cannot store NULL values**. Every row must contain a valid value for this column.

- **DEFAULT**
Automatically assigns a **predefined value** to a column when no value is provided during insertion.

- **UNIQUE**
Prevents **duplicate values** in a column or a combination of columns.  
Multiple NULL values are allowed, as NULLs are not considered equal.

- **CHECK** 
Enforces a **logical condition** on column values to satisfy business rules.  
Fully supported and enforced from **MySQL 8.0.16 onwards**.

- **PRIMARY KEY**
Uniquely identifies each record in a table.  
It implicitly enforces **NOT NULL** and **UNIQUE**, and only **one primary key** is allowed per table.

- **FOREIGN KEY**
Creates a **parent–child relationship** between tables.  
Ensures referential integrity and supports actions like cascading updates or deletes.

## NOT NULL
Ensures a column cannot store NULL values.

In [ ]:
CREATE DATABASE demo;

In [ ]:
USE demo;

In [ ]:
DROP TABLE IF EXISTS cust_notnull;

In [ ]:
CREATE TABLE IF NOT EXISTS cust_notnull (
    customer_id INT NOT NULL,
    customer_name VARCHAR(50) NOT NULL,
    email VARCHAR(100)
);

In [ ]:
DESC cust_notnull;

In [ ]:
INSERT INTO cust_notnull (customer_id, customer_name, email)
VALUES (1, 'Arjun Sharma', 'arjun@example.com');

INSERT INTO cust_notnull (customer_id, customer_name)
VALUES (2, 'Priya Nair');

In [ ]:
SELECT * FROM cust_notnull;

In [ ]:
INSERT INTO cust_notnull (customer_id, customer_name)
VALUES (NULL, 'Ramesh Iyer');
 -- Invalid

In [ ]:
INSERT INTO cust_notnull (customer_id, customer_name)
VALUES (3, 'ramesh@example.com'); -- Invalid

In [ ]:
SELECT * FROM CUST_NOTNULL;

## DEFAULT
Provides a value when none is given explicitly.

In [ ]:
DROP TABLE IF EXISTS cust_default;

In [ ]:
CREATE TABLE cust_default (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50) NOT NULL,
    status VARCHAR(20) NOT NULL DEFAULT 'Active'
);

In [ ]:
DESCRIBE cust_default;

In [ ]:
INSERT INTO cust_default (customer_id, customer_name)
VALUES (1, 'Meena Kumari');

INSERT INTO cust_default (customer_id, customer_name, status)
VALUES (2, 'Suresh Reddy', 'Inactive');

INSERT INTO cust_default (customer_id, customer_name)
VALUES (3, 'Raj Kamal');

In [ ]:
SELECT * FROM cust_default;

In [ ]:
INSERT INTO cust_default (customer_id, customer_name, status)
VALUES (3, 'Ananya Kadam', NULL);
 -- Invalid

In [ ]:
SELECT * FROM CUST_DEFAULT;

## UNIQUE
Prevents duplicate values in a column.

In [ ]:
DROP TABLE cust_unique;

In [ ]:
CREATE TABLE cust_unique (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE
);

In [ ]:
DESCRIBE cust_unique;

In [ ]:
INSERT INTO cust_unique (customer_id, customer_name, email)
VALUES (1, 'Kavita Pal', 'kavita@example.com');

INSERT INTO cust_unique (customer_id, customer_name, email)
VALUES (2, 'Neha Gupta', NULL);

In [ ]:
SELECT * FROM cust_unique;

In [ ]:
INSERT INTO cust_unique (customer_id, customer_name, email)
VALUES (3, 'Manoj Verma', 'kavita@example.com');

In [ ]:
INSERT INTO cust_unique (customer_id, customer_name, email)
VALUES (4, 'Arjun Lal', 'kavita@example.com');

In [ ]:
SELECT * FROM cust_unique;

- Unique ensures no two non-null values are the same.
- Multiple NULLs are allowed.

## CHECK
Restricts values to satisfy a condition.

In [ ]:
DROP TABLE IF EXISTS od_check;

In [ ]:
CREATE TABLE od_check (
    order_id INT,
    product_name VARCHAR(50),
    quantity INT CHECK (quantity BETWEEN 1 AND 100),
    price INT CHECK (price >= 1)
);

In [ ]:
DESCRIBE od_check;

In [ ]:
INSERT INTO od_check (order_id, product_name, quantity, price)
VALUES (101, 'Laptop', 1, 800);

INSERT INTO od_check (order_id, product_name, quantity, price)
VALUES (101, 'Mouse', 2, 200);

In [ ]:
SELECT * FROM od_check;

In [ ]:
INSERT INTO od_check VALUES (102, 'TV', 0, 1500);  -- Invalid

In [ ]:
INSERT INTO od_check VALUES (103, 'Remote', 1, -10);  -- Invalid

In [ ]:
SELECT * FROM od_check;

## PRIMARY KEY
Combines NOT NULL + UNIQUE to identify each row.

In [ ]:
DROP TABLE IF EXISTS prod_pk;

In [ ]:
CREATE TABLE prod_pk (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50) NOT NULL
);

In [ ]:
DESCRIBE prod_pk;

In [ ]:
INSERT INTO prod_pk (product_id, product_name)
VALUES (1, 'Laptop');

INSERT INTO prod_pk (product_id, product_name)
VALUES (2, 'Mouse');

In [ ]:
SELECT * FROM PROD_PK;

In [ ]:
INSERT INTO prod_pk
VALUES (2, 'Another Mouse');
-- Invalid

In [ ]:
INSERT INTO PROD_PK VALUES (NULL, 'TV'); -- Invalid

In [ ]:
SELECT * FROM PROD_PK;

## FOREIGN KEY
Links child to parent table.

In [ ]:
DROP TABLE IF EXISTS orders;

In [ ]:
DROP TABLE IF EXISTS cust_fk;

In [ ]:
CREATE TABLE cust_fk (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50) NOT NULL
);

In [ ]:
DESC cust_fk;

In [ ]:
CREATE TABLE orders_fk (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    FOREIGN KEY (customer_id) REFERENCES cust_fk(customer_id)
);

In [ ]:
DESC ORDERS_FK;

In [ ]:
SHOW CREATE TABLE orders_fk1;

In [ ]:
CREATE TABLE orders_fk1 (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    CONSTRAINT fk_orders_customer
        FOREIGN KEY (customer_id)
        REFERENCES cust_fk(customer_id)
);

In [ ]:
DESC orders_fk1;

In [ ]:
SHOW CREATE TABLE orders_fk1;

In [ ]:
INSERT INTO cust_fk
VALUES (1, 'Arjun Sharma');

INSERT INTO cust_fk
VALUES (2, 'Priya Nair');

In [ ]:
INSERT INTO orders_fk
VALUES (101, 1, '2025-01-10');

In [ ]:
INSERT INTO orders_fk
VALUES (102, 2, STR_TO_DATE('2025-01-11', '%Y-%m-%d'));

In [ ]:
SELECT * FROM CUST_FK;

In [ ]:
SELECT * FROM ORDERS_FK;

In [ ]:
INSERT INTO orders_fk
VALUES (103, 999, STR_TO_DATE('2025-01-12', '%Y-%m-%d'));
 -- Invalid

In [ ]:
SELECT * FROM CUST_FK;

In [ ]:
SELECT * FROM ORDERS_FK;

## Summary

| Constraint | Purpose | Example | Notes |
|------------|---------|---------|-------|
| NOT NULL | Mandatory value | `name VARCHAR2(50) NOT NULL` | Prevents NULLs |
| DEFAULT | Auto value if omitted | `status VARCHAR2(20) DEFAULT 'Active'` | Applied when missing |
| UNIQUE | Prevent duplicates | `email VARCHAR2(100) UNIQUE` | Multiple NULLs allowed |
| CHECK | Enforce condition | `CHECK (Quantity > 0)` | Business rule |
| PRIMARY KEY | Unique identifier | `id NUMBER PRIMARY KEY` | Combines NOT NULL + UNIQUE |
| FOREIGN KEY | Parent–child relation | `FOREIGN KEY (...) REFERENCES ...` | Options: CASCADE / SET NULL |